Semester-7/Технология разработки прикладных решений 1С/lab1/src/Reports/СамаяДоходнаяЭкскурсия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Report>
		<Properties>
			<Name>СамаяДоходнаяЭкскурсия</Name>
		</Properties>
	</Report>
</MetaDataObject>

Semester-7/Технология разработки прикладных решений 1С/lab1/src/Documents/ПосещениеЭкскурсии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ПосещениеЭкскурсии</Name>
			<BasedOn>
				<xr:Item>Document.Бронь</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Бронь</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Бронь</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Экскурсия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Экскурсии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Semester-7/Технология разработки прикладных решений 1С/lab1/src/Reports/СамаяДоходнаяЭкскурсия/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	СформироватьНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)

	СформироватьНаСервере();

КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПосещениеЭкскурсии.Экскурсия КАК Точка,
		|	СУММА(ПосещениеЭкскурсии.Сумма) КАК Значение
		|ИЗ
		|	Документ.ПосещениеЭкскурсии КАК ПосещениеЭкскурсии
		|ГДЕ
		|	ПосещениеЭкскурсии.Проведен
		|СГРУППИРОВАТЬ ПО
		|	ПосещениеЭкскурсии.Экскурсия
		|УПОРЯДОЧИТЬ ПО
		|	Значение УБЫВ";

	Выборка = Запрос.Выполнить().Выбрать();

	Диаграмма.Очистить();
	Диаграмма.ТипДиаграммы = ТипДиаграммы.Гистограмма;
	Серия = Диаграмма.УстановитьСерию("Доход");

	Пока Выборка.Следующий() Цикл
		Точка = Диаграмма.УстановитьТочку(Строка(Выборка.Точка));
		Диаграмма.УстановитьЗначение(Точка, Серия, Выборка.Значение);
	КонецЦикла;

КонецПроцедуры
